; domain
;;; Auto-generated PDDL file from prenex formula

(define (domain problem)

	(:constants
		zero
		max
	)

	(:predicates
		(holds_and_2 ?x0 ?x1)
		(holds_and_6 ?x0 ?x1)
		(holds_exists_8 ?x0)
		(holds_forall_9 ?x0)
		(holds_or_7 ?x0 ?x1)
		(n ?x0 ?x1)
		(not_t ?x0)
		(p ?x0 ?x1)
		(suc ?x0 ?x1)
		(t ?x0)
		(guess)
		(proof)
		(holds_goal)
	)

	(:action set_true_11
		:parameters	(?x0)
		:precondition	(and (not_t ?x0) (guess))
		:effect		(and (t ?x0) (not (not_t ?x0)))
	)
	(:action establish_forall_9_base
		:parameters	()
		:precondition	 (and (holds_exists_8 zero) (proof))
		:effect		(holds_forall_9 zero)
	)
	(:action establish_forall_9_inductive
		:parameters	( ?iv0 ?iv1)
		:precondition	(and (holds_forall_9 ?iv0) (suc ?iv0 ?iv1) (holds_exists_8 ?iv1) (proof))
		:effect		(holds_forall_9 ?iv1)
	)
	(:action establish_exists_8
		:parameters	(?y ?x)
		:precondition	 (and (holds_or_7 ?y ?x) (proof))
		:effect		(holds_exists_8 ?y)
	)
	(:action establish_or_7_0
		:parameters	(?y ?x)
		:precondition	 (and (holds_and_2 ?y ?x) (proof))
		:effect		(holds_or_7 ?y ?x)
	)
	(:action establish_or_7_1
		:parameters	(?y ?x)
		:precondition	 (and (holds_and_6 ?y ?x) (proof))
		:effect		(holds_or_7 ?y ?x)
	)
	(:action establish_and_2
		:parameters	(?y ?x)
		:precondition	(and (p ?x ?y) (t ?x) (proof))
		:effect		(holds_and_2 ?y ?x)
	)
	(:action establish_and_6
		:parameters	(?y ?x)
		:precondition	(and (n ?x ?y) (not_t ?x) (proof))
		:effect		(holds_and_6 ?y ?x)
	)
	(:action begin-proof
		:precondition	(guess)
		:effect		(and (proof) (not (guess)))
	)
	(:action prove-goal
		:precondition	 (and (holds_forall_9  max) (proof))
		:effect		(holds_goal)
	)
)

; problem
(define (problem a)
	(:domain problem)
	(:objects
		obj1
		obj2
	)
	(:init
		(guess)
		(suc zero obj1)
		(suc obj1 obj2)
		(suc obj2 max)
		(not_t zero)
		(not_t obj1)
		(not_t obj2)
		(not_t max)
		(p zero zero)
		(n zero obj1)
		(n zero obj2)
		(p obj2 zero)
		(n obj1 zero)
		(n obj2 obj1)
		(p obj1 obj2)
		(p zero max)
		
	)
	(:goal (holds_goal)
	)
)

; plan
1. (set_true_11 zero)
   deleted: (not_t zero)
   added: (t zero)
   goals met: 0 of 1
2. (set_true_11 obj1)
   deleted: (not_t obj1)
   added: (t obj1)
   goals met: 0 of 1
3. (begin-proof)
   deleted: (guess)
   added: (proof)
   goals met: 0 of 1
4. (establish_and_2 max zero)
   added: (holds_and_2 max zero)
   goals met: 0 of 1
5. (establish_or_7_0 max zero)
   added: (holds_or_7 max zero)
   goals met: 0 of 1
6. (establish_exists_8 max zero)
   added: (holds_exists_8 max)
   goals met: 0 of 1
7. (establish_and_6 obj1 obj2)
   added: (holds_and_6 obj1 obj2)
   goals met: 0 of 1
8. (establish_or_7_1 obj1 obj2)
   added: (holds_or_7 obj1 obj2)
   goals met: 0 of 1
9. (establish_exists_8 obj1 obj2)
   added: (holds_exists_8 obj1)
   goals met: 0 of 1
10. (establish_and_2 obj2 obj1)
   added: (holds_and_2 obj2 obj1)
   goals met: 0 of 1
11. (establish_or_7_0 obj2 obj1)
   added: (holds_or_7 obj2 obj1)
   goals met: 0 of 1
12. (establish_exists_8 obj2 obj1)
   added: (holds_exists_8 obj2)
   goals met: 0 of 1
13. (establish_and_2 zero zero)
   added: (holds_and_2 zero zero)
   goals met: 0 of 1
14. (establish_or_7_0 zero zero)
   added: (holds_or_7 zero zero)
   goals met: 0 of 1
15. (establish_exists_8 zero zero)
   added: (holds_exists_8 zero)
   goals met: 0 of 1
16. (establish_forall_9_base)
   added: (holds_forall_9 zero)
   goals met: 0 of 1
17. (establish_forall_9_inductive zero obj1)
   added: (holds_forall_9 obj1)
   goals met: 0 of 1
18. (establish_forall_9_inductive obj1 obj2)
   added: (holds_forall_9 obj2)
   goals met: 0 of 1
19. (establish_forall_9_inductive obj2 max)
   added: (holds_forall_9 max)
   goals met: 0 of 1
20. (prove-goal)
   added: (holds_goal)
   goals met: 1 of 1
